In [1]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\khali\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: numpy>=1.18.5 in c:\users\khali\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\khali\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\khali\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\khali\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
import pandas as pd

# LAB04

# Core components of pandas: Series and DataFrames


The primary two components of pandas are the 1. Series. 2. DataFrame.

# 1. Series

A Pandas Series is like a column in a table. It is a one-dimensional array holding data of any type.

In [3]:
x = ["Desy", "Wina", "Anis"]
y = pd.Series(x)
print(y)

0    Desy
1    Wina
2    Anis
dtype: object

Labels

If nothing else is specified, the values are labeled with their index number. First value has index 0, second value has index 1 etc.
This label can be used to access a specified value.

In [4]:
print(y[0])

Desy

Create Labels

With the index argument, you can name your own labels.

In [5]:
x = ["Desy", "Wina", "Anis"]
y = pd.Series(x, index = ["a", "b", "c"])
print(y)

a    Desy
b    Wina
c    Anis
dtype: object

In [6]:
print(y["b"])

Wina

# 2. DataFrame

It is a widely used data structure of pandas and works with a two-dimensional array with labeled axes (rows and columns). DataFrame is defined as a standard way to store data and has two different indexes. 

Series is like a column, a DataFrame is the whole table.

Creating DataFrame

There are many ways to create a DataFrame from scratch, but a great option is to just use a simple dict.

In [7]:
data = {
'Names': ["Desy", "Wina", "Anis"],
'Age': [19, 20, 22]
}

In [8]:
MyData = pd.DataFrame(data)

In [9]:
MyData

  Names  Age
0  Desy   19
1  Wina   20
2  Anis   22

# How to Save DataFrame to CSV

Often times when you convert your data into a DataFrame, you will process it and then ultimately save it to disk. To do this, we have a few different options, such as CSV and JSON. To save your DataFrame to a
CSV file, you can write the following command:

In [10]:
MyData.to_csv("Deasy.csv")

# How to Read DataFrame from CSV

Now that we have the data saved to a CSV file, let us create a new DataFrame, name2, and read that data. We can do this with the command pd.read_csv(). As with to_csv, we can pass multiple arguments
here, but for now, we will stick with the one mandatory one, a string of the file that we wish to open. In this case, it is the same file we just created.

In [11]:
MyData2 = pd.read_csv("Deasy.csv")

In [12]:
MyData2

   Unnamed: 0 Names  Age
0           0  Desy   19
1           1  Wina   20
2           2  Anis   22

Notice that this DataFrame looks a bit off from what we saved to disk. Why is that? It is because of how we saved the file. If we donnot specify an index, Pandas will automatically create one for us. In order to
correctly save our file, we need to pass an extra keyword argument, specifically index=False. Let us try and save this file again under a different name: “names_no_index.csv”.

In [13]:
MyData.to_csv("Deasy_no_index.csv", index=False)

Let’s create a new DataFrame, MyData3, and reopen and print off the data.

In [16]:
MyData3 = pd.read_csv("Deasy_no_index.csv")

In [17]:
MyData3

  Names  Age
0  Desy   19
1  Wina   20
2  Anis   22

# Important DataFrame operations

DataFrames possess hundreds of methods and other operations that are crucial to any analysis. As a beginner, you should know the operations that perform simple transformations of your data and those that
provide fundamental statistical analysis.

In [20]:
customers = pd.read_csv("Mall_Customers.csv")
customers

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                15.0                      39
1             2    Male   21                15.0                      81
2             3  Female   20                16.0                       6
3             4  Female   23                16.0                      77
4             5  Female   31                17.0                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35               120.0                      79
196         197  Female   45               126.0                      28
197         198    Male   32               126.0                      74
198         199    Male   32               137.0                      18
199         200    Male   30               137.0                      83

[200 rows x 5 columns]

We're loading this dataset from a CSV and designating the CustomerID to be our index.

# Viewing your data

The first thing to do when opening a new dataset is print out a few rows to keep as a visual reference. We accomplish this with .head(). It will be show first 5 (0, 1, 2, 3, 4).

In [19]:
customers.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                15.0                      39
1           2    Male   21                15.0                      81
2           3  Female   20                16.0                       6
3           4  Female   23                16.0                      77
4           5  Female   31                17.0                      40

.head() outputs the first five rows of your DataFrame by default, but we could also pass a number as well: customers.head(10) would output the top ten rows, for example.

In [21]:
customers.head(10)

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                15.0                      39
1           2    Male   21                15.0                      81
2           3  Female   20                16.0                       6
3           4  Female   23                16.0                      77
4           5  Female   31                17.0                      40
5           6  Female   22                17.0                      76
6           7  Female   35                18.0                       6
7           8  Female   23                18.0                      94
8           9    Male   64                19.0                       3
9          10  Female   30                19.0                      72

To see the last five rows use .tail().


tail() also accepts a number, and in this case we printing the bottom two rows.:

In [22]:
customers.tail(5)

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35               120.0                      79
196         197  Female   45               126.0                      28
197         198    Male   32               126.0                      74
198         199    Male   32               137.0                      18
199         200    Male   30               137.0                      83

Typically when we load in a dataset, we like to view the first five or so rows to see what's under the hood. Here we can see the names of each column, the index, and examples of values in each row.

# Getting info about your data

.info() should be one of the very first commands you run after loading your data:

In [23]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      192 non-null    float64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: float64(1), int64(3), object(1)
memory usage: 7.9+ KB

.info() provides the essential details about your dataset, such as the number of rows and columns, the number of non-null values, what type of data is in each column, and how much memory your DataFrame is
using.


Another fast and useful attribute is .shape, which outputs just a tuple of (rows, columns):

In [24]:
customers.shape

(200, 5)

Note that .shape has no parentheses and is a simple tuple of format (rows, columns). So we have 200 rows and 5 columns in our movies DataFrame.


You will be going to .shape a lot when cleaning and transforming data. For example, you might filter some rows based on some criteria and then want to know quickly how many rows were removed.

# Handling duplicates

This dataset does not have duplicate rows, but it is always important to verify you aren't aggregating duplicate rows.

To demonstrate, let us simply just double up our customer DataFrame by appending it to itself:

In [26]:
customer_df = customers.append(customers)
customer_df.shape

C:\Users\khali\AppData\Local\Temp\ipykernel_20720\2596030322.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  customer_df = customers.append(customers)

(400, 5)

Using append() will return a copy without affecting the original DataFrame. We are capturing this copy in customer so we are not working with the real data.

Notice call .shape quickly proves our DataFrame rows have doubled.

Try dropping duplicates:

In [27]:
customer_df = customer_df.drop_duplicates()
customer_df.shape

(200, 5)

Just like append(), the drop_duplicates() method will also return a copy of your DataFrame, but this time with duplicates removed. Calling .shape confirms we're back to the 200 rows of our original dataset.

It's a little verbose to keep assigning DataFrames to the same variable like in this example. For this reason, pandas has the inplace keyword argument on many of its methods. Using inplace=True will modify
the DataFrame object in place:

In [28]:
customer_df.drop_duplicates(inplace=True)

Now our customer_df will have the transformed data automatically.


Another important argument for drop_duplicates() is keep, which has three possible options:

first: (default) Drop duplicates except for the first occurrence.

last: Drop duplicates except for the last occurrence.

False: Drop all duplicates.


Since we did not define the keep arugment in the previous example it was defaulted to first. This means that if two rows are the same pandas will drop the second row and keep the first row. Using last has the
opposite effect: the first row is dropped.


keep, on the other hand, will drop all duplicates. If two rows are the same then both will be dropped. Watch what happens to customer_df:

In [29]:
customer_df = customers.append(customers) # make a new copy
customer_df.drop_duplicates(inplace=True, keep=False)
customer_df.shape

C:\Users\khali\AppData\Local\Temp\ipykernel_20720\1872585575.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  customer_df = customers.append(customers) # make a new copy

(0, 5)

Since all rows were duplicates, keep=False dropped them all resulting in zero rows being left over. If you arre wondering why you would want to do this, one reason is that it allows you to locate all duplicates in
your dataset. When conditional selections are shown below you will see how to do that.

In [30]:
customers.columns

Index(['CustomerID', 'Genre', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

Not only does .columns come in handy if you want to rename columns by allowing for simple copy and paste, it's also useful if you need to understand why you are receiving a Key Error when selecting data by
column.

We can use the .rename() method to rename certain or all columns via a dict.

In [31]:
customers.rename(columns={
'Annual Income (k$)': 'Annual Income'
}, inplace=True)

customers.columns

Index(['CustomerID', 'Genre', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

# How to work with missing values

When exploring data, you will most likely encounter missing or null values, which are essentially placeholders for non-existent values.

There are two options in dealing with nulls:
1. Get rid of rows or columns with nulls
2. Replace nulls with non-null values, a technique known as imputation

Let's calculate to total number of nulls in each column of our dataset. The first step is to check which cells in our DataFrame are null:

In [32]:
customers.isnull()

     CustomerID  Genre    Age  Annual Income  Spending Score (1-100)
0         False  False  False          False                   False
1         False  False  False          False                   False
2         False  False  False          False                   False
3         False  False  False          False                   False
4         False  False  False          False                   False
..          ...    ...    ...            ...                     ...
195       False  False  False          False                   False
196       False  False  False          False                   False
197       False  False  False          False                   False
198       False  False  False          False                   False
199       False  False  False          False                   False

[200 rows x 5 columns]

Notice isnull() returns a DataFrame where each cell is either True or False depending on that cell's null status.

To count the number of nulls in each column we use an aggregate function for summing:

In [33]:
customers.isnull().sum()

CustomerID                0
Genre                     0
Age                       0
Annual Income             8
Spending Score (1-100)    0
dtype: int64

.isnull() just by iteself is not very useful, and is usually used in conjunction with other methods, like sum().

We can see now that our data has 8 missing values for Annual Income.

# Removing null values

Data Scientists and Analysts regularly face the dilemma of dropping or imputing null values, and is a decision that requires intimate knowledge of your data and its context. Overall, removing null data is only
suggested if you have a small amount of missing data.

In [34]:
customers.dropna(axis=1)

     CustomerID   Genre  Age  Spending Score (1-100)
0             1    Male   19                      39
1             2    Male   21                      81
2             3  Female   20                       6
3             4  Female   23                      77
4             5  Female   31                      40
..          ...     ...  ...                     ...
195         196  Female   35                      79
196         197  Female   45                      28
197         198    Male   32                      74
198         199    Male   32                      18
199         200    Male   30                      83

[200 rows x 4 columns]

This operation will delete any row with at least a single null value, but it will return a new DataFrame without altering the original one. You could specify inplace=True in this method as well.

So in the case of our dataset, this operation would remove 8 rows where Annual Income is null.

This obviously seems like a waste since there is perfectly good data in the other columns of those dropped rows. That is why we will look at imputation next.

Other than just dropping rows, you can also drop columns with null values by setting axis=1:

# Imputation

Imputation is a conventional feature engineering technique used to keep valuable data that have null values.

There may be instances where dropping every row with a null value removes too big a chunk from your dataset, so instead we can impute that null with another value, usually the mean or the median of that
column.

Let's look at imputing the missing values in the Annual Income column. First we will extract that column into its own variable:

In [35]:
income = customers['Annual Income']

In [36]:
income.head()

0    15.0
1    15.0
2    16.0
3    16.0
4    17.0
Name: Annual Income, dtype: float64

In [37]:
income_mean = income.mean()
income_mean

59.848958333333336

In [38]:
income.fillna(income_mean, inplace=True)

In [39]:
customers.isnull().sum()

CustomerID                0
Genre                     0
Age                       0
Annual Income             0
Spending Score (1-100)    0
dtype: int64

# Understanding our Variables

Using describe() on an entire DataFrame we can get a summary of the distribution of continuous variables:

In [40]:
customers.describe()

       CustomerID         Age  Annual Income  Spending Score (1-100)
count  200.000000  200.000000     200.000000              200.000000
mean   100.500000   38.850000      59.848958               50.200000
std     57.879185   13.969007      25.999867               25.823522
min      1.000000   18.000000      15.000000                1.000000
25%     50.750000   28.750000      41.500000               34.750000
50%    100.500000   36.000000      59.924479               50.000000
75%    150.250000   49.000000      77.000000               73.000000
max    200.000000   70.000000     137.000000               99.000000

In [41]:
customers["Genre"].describe()

count        200
unique         2
top       Female
freq         112
Name: Genre, dtype: object

In [42]:
customers['Genre'].value_counts().head(10)

Female    112
Male       88
Name: Genre, dtype: int64

# Relationships between Continuous Variables

By using the correlation method .corr() we can generate the relationship between each continuous variable:

In [43]:
customers.corr()

,CustomerID,Age,Annual Income,Spending Score (1-100)
CustomerID,1.000000,-0.026763,0.961257,0.013835
Age,-0.026763,1.000000,-0.020049,-0.327227
Annual Income,0.961257,-0.020049,1.000000,0.017012
Spending Score (1-100),0.013835,-0.327227,0.017012,1.000000

Correlation tables are a numerical representation of the bivariate relationships in the dataset.

Positive numbers indicate a positive correlation — one goes up the other goes up — and negative numbers represent an inverse correlation — one goes up the other goes down. 1.0 indicates a perfect
correlation.

# DataFrame Slicing, Selecting, Extracting

Below are some methods of slicing, selecting, and extracting you will need to use constantly.

It's important to note that, although many methods are the same, DataFrames and Series have different attributes, so you will need be sure to know which type you are working with or else you will receive
attribute errors.

# By column

In [44]:
Genre_col = ['Genre']
type(Genre_col)

list

This will return a Series. To extract a column as a DataFrame, you need to pass a list of column names. In our case that is just a single column:

In [45]:
Genre_col = customers[['Genre']]
type(Genre_col)

pandas.core.frame.DataFrame

In [46]:
subset = customers[['Genre', 'Annual Income']]
subset.head()

    Genre  Annual Income
0    Male           15.0
1    Male           15.0
2  Female           16.0
3  Female           16.0
4  Female           17.0

# By rows

For rows, we have two options:
1. .loc: Locates by name
2. .iloc: Locates by numerical index

In [47]:
# Creating the DataFrame
data1 = pd.DataFrame({'Name':['Desy', 'Anis', 'Wina', 'Nita', 'Shine'],
'Age':[19, 20, 21, 22, 23]})
# Create the index
index1 = ['A', 'B', 'C', 'D', 'E']
# Set the index
data1.index = index1

In [48]:
Data_rows = data1.loc["A","Name"]
Data_rows

'Desy'

On the other hand, with iloc we give it the numerical index of Name:

In [49]:
customer = data1.iloc[0]
customer

Name    Desy
Age       19
Name: A, dtype: object

loc and iloc can be thought of as similar to Python list slicing.

# Alhamdulillah